

[
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "South China Morning Post",
      "source_icon": "https://www.bing.com/th?id=AR_cf1a9f3235e56cc9198b835c2a251917&pid=news",
      "title_article": "Can Harry Potter give Universal Studios the edge in China up against coronavirus, rising patriotism?",
      "description_article": "The 50 billion yuan (US$7.7 billion) project in Beijing is the first Universal Studios theme park in China, but the opening was delayed due to the coronavirus.",
      "url_article": "https://www.scmp.com/economy/china-economy/article/3145995/can-harry-potter-give-universal-studios-edge-china-against",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.Zqh51fnMgWz0Uk5g6REq7y",
      "publishedAt_article": "2021-08-23T16:21:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.scmp.com/economy/china-economy/article/3145995/can-harry-potter-give-universal-studios-edge-china-against",
         "title_article": "Does Harry Potter have the magic to help Universal Studios succeed in China?",
         "description_article": "",
         "urtToImage_article": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2021/08/23/6db3a11e-03dd-11ec-a83e-ec0670db1017_image_hires_162132.jpg?itok=kUiCZ7bA&v=1629706901",
         "publishedAt_article": "2021-08-23T05:56:09.000Z",
         "content_article": "   Phase one of Universal Studios Beijing is expected to open in late August after the initial opening schedule was delayed due to the outbreak of the coronavirus after construction began in 2015. Illustration: Brian Wang",
         "article_author": "None"
      },
      "summarized_article": [
         {
            "summary_text": "Phase one of Universal Studios Beijing is expected to open in late August. The initial opening schedule was delayed due to the outbreak of the coronavirus after construction began in 2015. The first phase of the theme park will be open to the public for the first time in two years."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "Boston.com",
      "source_icon": "https://www.bing.com/th?id=AR_a3519d628c6106b1589362db2ed45ca0&pid=news",
      "title_article": "Hundreds of thousands of people who qualify for food assistance in Mass. don’t apply, study says. Here’s why.",
      "description_article": "\"We know there’s a gap, which is really important, now how are we actually going to close it.”  Read more on Boston.com.",
      "url_article": "https://www.boston.com/news/local-news/2021/08/23/food-assistance-barriers-massachusetts/",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.xVNdT2D5qplKyKz7eDV_Vy",
      "publishedAt_article": "2021-08-23T16:19:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.boston.com/news/local-news/2021/08/23/food-assistance-barriers-massachusetts/",
         "title_article": "Hundreds of thousands of people who qualify for food assistance in Mass. don't apply, study says. Here's why.",
         "description_article": "",
         "urtToImage_article": "https://bdc2020.o0bc.com/wp-content/uploads/2021/08/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_corona207-61200e3c640a2-scaled.jpg",
         "publishedAt_article": "2021-08-23T12:19:13.000Z",
         "content_article": "When the state shut down in March 2020 due to the pandemic, thousands of people were left without jobs, and nearly 20 percent of residents were left food insecure, according to a recent study. One of those people was Chelsea resident Anna, whose name has been changed to protect her privacy. For the past 15 years, she had worked at a flower shop, but she lost her job during the shutdown. Anna applied for unemployment, as well as the federal Supplemental Nutrition Assistance Program, or SNAP, but when the unemployment kicked in, she was approved to receive just $16 per month. “That obviously didn’t help me with anything,” Anna told Boston.com through an interpreter as English isn’t her first language. Fortunately for Anna, she was able to get help with her SNAP application via Project Bread, which has a FoodSource Hotline to help people apply for these benefits. Certain barriers keep people from taking advantage of these benefits, according to a study conducted by Project Bread, the Boston Office of Food Access, and the UMass Boston Center for Survey Research. In Massachusetts, they number 659,340. Some of the barriers include attitudes toward the program, including stigmas or incorrect ideas of who SNAP helps, to fears of applying due to immigration status, to a surprising amount of eligible people who just don’t know about the program. The study did identify some ways to combat these barriers, including awareness, making the application easier, and increasing the amount of benefits beyond “a subsistence diet.” Food insecurity soars during the pandemic As the COVID-19 crisis quickly unfolded in spring 2020, the need for food assistance skyrocketed, according to Erin McAleer, CEO of Project Bread. She noted that at the peak, the organization’s food hotline received seven times its usual call volume. While no longer at the peak of need, there’s still many more calls than prior to the pandemic. “I mean we’ve doubled the size of our FoodSource Hotline staff as an example,” she told Boston.com in a recent interview. The proof is also in the numbers — signups for SNAP in Massachusetts rose by over 21 percent between February 2020 and May 2021, according to the study. While SNAP is “a more complicated program” than some of the other food assistance initiatives, McAleer also described the benefits. “It’s the most effective anti-hunger program, and I think that’s really important because it gives people the purchasing power to buy food,” she said. Most people on SNAP are children, McAleer said. During 2019, children made up 43 percent of the people who were signed up. The next highest demographic was adults who weren’t elderly or disabled, according to the U.S. Department of Agriculture Food and Nutrition Service. SNAP also has economic benefits, according to the study. For every $1 spent using SNAP benefits, $1.70 is created in economic activity. “It puts money back into communities,” McAleer said. SNAP also uses existing grocery stores versus some anti-hunger programs that involve transporting food. SNAP barriers For Anna, receiving SNAP benefits was critical when she lost her job due to COVID-19. She was one of the many people to sign up for SNAP for the first time during the crisis. She’s always had a job, she said, but the pandemic quickly took it away. Anna also contracted COVID-19. Anna also has to rely on herself. She lives with one of her adult children, she said, but that’s it. Her husband was deported back to Guatemala about a year-and-a-half ago, she said. “I’ve been on my own since,” she said, noting that she does get some help from a social worker, who has helped her seek treatment for her depression, among other assistance. Turning to the food hotline helped Anna get her SNAP application in, but for many, just filling out the application is a barrier. The study surveyed 823 people to ask them about SNAP awareness. It also endeavored to show how the way someone feels about the program could affect whether they sign up. The survey delved into what experiences have been like using SNAP, as well. Of the people surveyed, nearly 80 percent were worried that they would run out of food before they were able to buy more. The top barrier was misinformation, according to the study. People are concerned they could be taking the benefits away from someone else who needs them more. It isn’t true, McAleer said. SNAP doesn’t run out. “SNAP is meant to expand during economic downturns and retract when the economy is improving,” she said. “It is based on who needs it. It is an entitlement program if you’re eligible for it. So you’re absolutely not taking it away from anyone else.” Another barrier is computer access, with 43 percent of respondents identifying it as something that would block them from applying. Then there are the stigmas, with nearly 39 percent of respondents saying they were worried about them. One of them is the idea that those eligible should get a job versus applying for food benefits, according to McAleer. However, she pointed to the fact that kids make up the largest percentage of people using it. As for adults, she said many are working, but just are not making enough money. Some of those eligible workers also don’t apply for SNAP because they think it’s just for the unemployed. “I do think this program in particular has unfortunately been political fodder in election after election, and we’re seeing how the misconceptions about the program and false narratives have unfortunately impacted people,” McAleer said. “They’ve caused people to go hungry unnecessarily, and so it’s on all of us to really change the narrative.” Having difficulty filling out the application is also a barrier, the study shows. Then there’s the people who just don’t know about it — about 32 percent of respondents said they either knew little or nothing about the program. When considering just BIPOC respondents, the barriers they identified were slightly different. One of them was immigration status — just over 30 percent of Latino respondents and 38 percent of Asian respondents identified this as a reason for not applying. More than 38 percent of Latino respondents and over 55 percent of Asian respondents also identified the application’s language as a barrier. Project Bread’s food hotline is offered in 180 languages. How to close the gap The study identified multiple ways to make it so that more eligible people sign up for SNAP and don’t go needlessly hungry. Awareness is key, the study said. Other proposed improvements, according to the study, include: Making the application easier, as well as having organizations that work with the food insecure provide things like computer access, or a hotline, like the one at Project Bread.Making SNAP benefits available to those who aren’t currently eligible but are facing food insecurity. This could include eligibility changed regarding income or immigration status.Increasing SNAP benefits beyond providing a “subsistence diet.” This could include making the Health Incentives Program, or HIP, permanent. HIP allows those using SNAP to buy food from farmers, like at farmers’ markets or farm stands.Devising a national plan to work on hunger and food insecurity.Making it so that the idea of needing help is normal, and changing damaging language around it.Taking a critical look at research, and making inclusion a priority.“I think what we really tried to do in our research report is lay out specific things we need to do right now, specific things at the federal level, the state level, programmatically, because the moment’s now,” McAleer said. “We need to be addressing these disparities. So we know there’s a gap, which is really important, now how are we actually going to close it.”    Stay up to date on all the latest news from Boston.com  \n\n",
         "article_author": "None"
      },
      "summarized_article": [
         {
            "summary_text": "When the state shut down in March 2020 due to the pandemic, thousands of people were left without jobs. Nearly 20 percent of residents were left food insecure, according to a recent study. For many, just filling out the application is a barrier. The study identified some ways to combat these barriers."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "Mansion Global",
      "source_icon": "https://www.bing.com/th?id=AR_4c6f107c2aab8732aa972163550c07ea&pid=news",
      "title_article": "Manhattan’s Luxury Home Market on Track for a Banner Year",
      "description_article": "Manhattan is poised to log one of the strongest years on record across its high-end property market despite the ongoing complications from the coronavirus pandemic, according to a report Monday from Olshan Realty.",
      "url_article": "https://www.mansionglobal.com/articles/manhattans-luxury-home-market-on-track-for-a-banner-year-01629735132",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.mNIr9Zn2s1WIvxUV4bK-By",
      "publishedAt_article": "2021-08-23T16:12:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.mansionglobal.com/articles/manhattans-luxury-home-market-on-track-for-a-banner-year-01629735132",
         "title_article": "Manhattan’s Luxury Home Market on Track for a Banner Year",
         "description_article": "",
         "urtToImage_article": "https://images.mansionglobal.com/im-389819/social",
         "publishedAt_article": "None",
         "content_article": " Manhattan is poised to log one of the strongest years on record across its high-end property market despite the ongoing complications from the coronavirus pandemic, according to a report Monday from Olshan Realty.  The success is a drastic contrast to 2020, which marked the worst-performing luxury sector for the borough in a decade. Over $10 billion in contracts have been signed on luxury homes priced at $4 million or more—the report’s benchmark for luxury—in the borough so far this year, said Donna Olshan, author of the weekly report and president of Olshan Realty.  Helping to drive deals are persistently low interest rates and a soaring stock market, Ms. Olshan has said previously.  The 24 contracts signed during the week ending Sunday contributed a little over $168 million to that total, and marked only the third time since the start of February that the number of weekly signed contracts fell below 30. The most expensive deal made last week was for a three-bedroom condo at Midtown’s 53 West 53. The apartment in the Jean Nouvel-designed tower was asking $14.5 million and spans 3,251 square feet with 11-foot ceilings and city views.   From Penta: Great Escapes: Lisbon’s Old-World Charm   The second-priciest contract signed was on a $12.03 million condo unit at 15 Hudson Yards. The four-bedroom corner unit spans close to 3,000 square feet and has access to the 88-story building’s 40,000 square feet of amenities, including a fitness center, a pool and a ballroom.  Condos were once again the home of choice for Manhattan’s wealthy buyers last week, accounting for 18 of the high-end homes to find buyers. Contracts were also signed on five co-ops and one townhouse, according to the report.  \n   Delivers the most important property news around the world to your inbox each weekday  \n ",
         "article_author": "Liz Lucking"
      },
      "summarized_article": [
         {
            "summary_text": "Over $10 billion in contracts have been signed on luxury homes priced at $4 million or more in Manhattan so far this year. The most expensive deal made last week was for a three-bedroom condo at Midtown’s 53 West 53. Condos were once again the home of choice for Manhattan's wealthy buyers last week."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "Mercury News",
      "source_icon": "https://www.bing.com/th?id=AR_b7cdc2df8afb41d7cc13684585e4ff57&pid=news",
      "title_article": "High school football: Longtime Clayton Valley coach to retire after this season",
      "description_article": "Tim Murphy will step aside from Clayton Valley after this season and hand the reins to Nick Tisa, ending a decade-long run leading the Ugly Eagles and a decorated coaching career.",
      "url_article": "https://www.mercurynews.com/2021/08/23/high-school-football-longtime-clayton-valley-coach-to-retire-after-this-season/",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.BS3ukbKnX9foztwIXr9yeC",
      "publishedAt_article": "2021-08-23T16:10:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.mercurynews.com/2021/08/23/high-school-football-longtime-clayton-valley-coach-to-retire-after-this-season",
         "title_article": "High school football: Longtime Clayton Valley coach to retire after this season",
         "description_article": "",
         "urtToImage_article": "https://www.mercurynews.com/wp-content/uploads/2019/12/BNG-L-CLAYTONVLY-1213-15.jpg?w=1024&h=683",
         "publishedAt_article": "2021-08-23T16:10:19.000Z",
         "content_article": "Somewhere, Tim Murphy has a copy of the resignation letter he drafted after last spring. He brought it with him into the meeting he called to step down but returned home, letter in hand. “I went in there during summer to retire,” the Clayton Valley (Concord) coach said. “They said, ‘Come on, man, give us one more year.’ I said, ‘Hell no, I’m done.’ … I came home with my retirement letter, and my wife saw it still in my hand. Oh, she was hot.” Murphy, instead, will act on those intentions after this upcoming fall season, he told the Bay Area News Group, ending a decade-long run leading the Ugly Eagles and a decorated coaching career. He’ll turn the keys to the program over to assistant Nick Tisa, who stepped into a co-head coach role this fall. “He’s doing more of the stuff on the field, and I’m coaching the coaches,” Murphy said, regarding their split duties this season. “I’m trying to get him to be as close to a head coach as possible.” “We don’t want to use the word ‘mentor,’” said Tisa, who spent six seasons leading the program at Dougherty Valley before joining Murphy’s staff in 2018. “I’ve just been the assistant here, kind of being that kick-ass assistant coach, you know.” Tisa has been the Ugly Eagles’ defensive backs coach and, as a teacher on campus, Murphy’s coordinator for all things in the classroom. (Murphy, a physical education teacher and the team’s strength trainer, plans to remain in those roles.) In six seasons at Dougherty Valley, Tisa led one winning campaign, but that matched his predecessor and, so far, has bested his successors. As a defensive-minded coach, he’s had to study Murphy’s signature double-wing offense, an old-school system that churns out thousand-yard rushers. Murphy’s 2014 Clayton Valley team set a state record for large schools with 7,055 rushing yards. Murphy’s obsessive study of tape is what has stood out above all, Tisa said. “Really, what I learned most was his knowledge of film,” Tisa said. “I mean, he’s big on filming everything in practice, and then we watch film with kids. … When he calls a play, he knows exactly what all 11 guys should do and what the play should look like from every position.” When Murphy hired Tisa at Clayton Valley, his eventual retirement plans didn’t come up. Tisa said he took the job primarily because the commute — 10 minutes, versus an hour-plus to Dougherty Valley — and that his previous years of teaching experience transferred. But Murphy, who said he’s been fighting retirement for a few years, has been grooming his successor to the point that he recommended Tisa for the position in his retirement letter. “The other two programs I left, when they went out of my coaching assistants to take the program over, it fell apart,” Murphy said. “I really like Nick. … To me, he’s the perfect guy to come in and take this over full-time.” If all had gone according to plan this summer, that transition would have taken place in full this season. But, Murphy said, it was Clayton Valley’s new superintendent, Dave Fehte, who hatched the plan that convinced Murphy to stay for one more year. “I don’t know that I would have been able to be talked out of it if it wasn’t for this guy being such a good guy and a guy I believe in,” Murphy said of Fehte, who entered the interim role in May. “I was ready to go to friggin’ Cabo, the Bahamas, the full nine yards.” Murphy’s coaching career began, as he remembers it, the Monday after he graduated from UC Santa Barbara, almost 30 years ago. This fall will be his 25th season as a head coach and his 10th at Clayton Valley, where he led the Ugly Eagles to their first state title in 2019. At all three stops along the way — Ygnacio Valley, Clovis East and Clayton Valley — Murphy delivered each school’s first section championship. His 2006 team at Clovis East ended the season ranked in the top 25 nationally — and earned him national recognition, winning the ESPY for coach of the year. Altogether, Murphy has more than 200 wins to his name, including a 91-21 record through nine seasons at Clayton Valley. One the reasons Murphy wanted to make the announcement official, he said, was so that he doesn’t get roped into one more year. “I can’t do that to my wife and family anymore,” he said. “I’m already in the doghouse for coming home with that retirement letter.” ",
         "article_author": "Evan Webeck"
      },
      "summarized_article": [
         {
            "summary_text": "Tim Murphy will step down as head coach of Clayton Valley (Concord) high school football team. Murphy will hand the keys to the program over to assistant Nick Tisa, who stepped into a co-head coach role this fall. Tisa has been the Ugly Eagles’ defensive backs coach and Murphy’s coordinator for all things in the classroom."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "ESPN",
      "source_icon": "https://www.bing.com/th?id=AR_7bcc401a185154c855a1b6467edebc3b&pid=news",
      "title_article": "New York Jets LB Jarrad Davis expected to miss about 2 months with ankle injury",
      "description_article": "FLORHAM PARK, N.J. - New York Jets linebacker Jarrad Davis is expected to miss about two months with a left ankle injury, another blow to their reeling defense. Coach Robert Saleh, speaking to reporters Monday,",
      "url_article": "https://www.espn.com/nfl/story/_/id/32072001/new-york-jets-lb-jarrad-davis-expected-miss-2-months-ankle-injury",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.0muZetEJp_fPIfalAM0oWS",
      "publishedAt_article": "2021-08-23T16:10:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.espn.com/nfl/story/_/id/32072001/new-york-jets-lb-jarrad-davis-expected-miss-2-months-ankle-injury",
         "title_article": "New York Jets LB Jarrad Davis expected to miss about 2 months with ankle injury",
         "description_article": "",
         "urtToImage_article": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0823%2Fr899460_1296x729_16%2D9.jpg",
         "publishedAt_article": "None",
         "content_article": "12:10 PM ETFLORHAM PARK, N.J. - New York Jets linebacker Jarrad Davis is expected to miss about two months with a left ankle injury, another blow to their reeling defense.Coach Robert Saleh, speaking to reporters Monday, wouldn't specify the nature of Davis' injury, except to say it's not a high ankle sprain. Saleh said they hope to have him back \"around the bye week,\" which is Week 6 for the Jets.A trip to injured reserve seems inevitable. As long as Davis is on the initial 53-man roster after the final cutdown on Aug. 31, he will be eligible to return after three weeks on IR.Davis was carted to the locker room in Saturday's 23-14 win over the Green Bay Packers at Lambeau Field. Two days earlier, in a joint practice with the Packers, defensive end Carl Lawson suffered a season-ending Achilles' injury.Lawson and Davis were two of the Jets' biggest offseason acquisitions on defense. Lawson signed a three-year, $45 million contract; Davis, a former first-round pick of the Detroit Lions, signed for $5.5 million on a one-year deal.\"I don't think it's hard on me as much as it's hard on them,\" Saleh said of Davis and Lawson. \"We'll figure it out. Someone will step up and we'll keep moving.\"The situation is dire at linebacker. The only proven player is middle linebacker C.J. Mosley, who has played only two games over the last two seasons due to injuries and an opt-out for COVID-19 reasons.Rookie Jamien Sherwood, a fifth-round pick, will replace Davis on the strong side in their 4-3 front. The weak-side starter will be Noah Dawkins (15 career games), who started Saturday, or sixth-round pick Hamsah Nasirildeen, who had been getting the first-team reps in training camp.Compounding the concern: Sherwood and Nasirildeen are both new to the linebacker position. They played safety at Auburn and Florida State, respectively. The Jets drafted them with the idea of converting them to linebackers because of their speed and coverage ability.Speaking of Sherwood, Saleh made a loose comparison to San Francisco 49ers All-Pro middle linebacker Fred Warner, whom he coached from 2018 to 2020. He meant from a size and position-switch standpoint.\"I want to make sure I say this right,\" Saleh. \"I'm not comparing him to Fred yet - he's got a long way to go - but Fred played nickel in college and was maybe 220, 225 his rookie year. (We) threw him in at Mike linebacker, started him Day 1 and he took off.\"Saleh called Sherwood an \"unbelievable communicator\" with excellent instincts and intelligence. The Jets also have veteran Blake Cashman, an oft-injured backup.The Jets are working out free-agent linebackers and they're exploring possible trades for a pass rusher to replace Lawson, ESPN's Adam Schefter reported Sunday. Saleh sidestepped a question about a potential trade, saying he's focused on the roster.\"There's always going to be personnel discussions,\" he said.In other injury news, backup tackle Conor McDermott (knee) is expected to miss significant time. Backup quarterback Mike White (ribs), defensive end Ronnie Blair (hamstring), guard Alijah Vera-Tucker (pectoral strain) and wide receiver Elijah Moore (quadriceps) are day-to-day.\n",
         "article_author": "None"
      },
      "summarized_article": [
         {
            "summary_text": "Jarrad Davis is expected to miss about two months with a left ankle injury. Coach Robert Saleh wouldn't specify the nature of Davis' injury, except to say it's not a high ankle sprain. Saleh said they hope to have him back \"around the bye week,\" which is Week 6."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "Houston Chronicle",
      "source_icon": "https://www.bing.com/th?id=AR_498b7ec640fbc692daf9710f9dda1ae0&pid=news",
      "title_article": "School mask, vaccine mandates supported in US: AP-NORC poll",
      "description_article": "About 6 in 10 Americans say students and teachers should be required to wear face masks while in school, according to a poll from The. Similar shares say teachers and eligible students should also be required to receive a COVID-19 vaccine.",
      "url_article": "https://www.chron.com/living/article/School-mask-vaccine-mandates-supported-in-US-16404973.php",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.0UkIQM8cj4iiX7flARNVli",
      "publishedAt_article": "2021-08-23T16:09:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.chron.com/news/article/School-mask-vaccine-mandates-supported-in-US-16404973.php",
         "title_article": "School mask, vaccine mandates supported in US: AP-NORC poll",
         "description_article": "",
         "urtToImage_article": "https://s.hdnux.com/photos/01/21/44/21/21382267/3/rawImage.jpg",
         "publishedAt_article": "2021-08-23T12:00:13.000Z",
         "content_article": "   1of11FILE - In this Aug. 17, 2021, file photo, wearing masks to prevent the spread of COVID-19, elementary school students line up to enter school for the first day of classes in Richardson, Texas. As COVID-19 cases surge, a majority of Americans say they support mask mandates for students and teachers in K-12 schools, but their views are sharply divided along political lines.LM Otero/APShow MoreShow Less 2of11FILE - In this Aug. 11, 2021, file photo, California Gov. Gavin Newsom sits with students of a second grade classroom at Carl B. Munck Elementary School in Oakland, Calif. Gov. As COVID-19 cases surge, a majority of Americans say they support mask mandates for students and teachers in K-12 schools, but their views are sharply divided along political lines. (Santiago Mejia/San Francisco Chronicle via AP, Pool)Santiago Mejia/APShow MoreShow Less 4of11FILE - In this July 27, 2021, file photo, Health Commissioner Dr. Dave Chokshi, center, joins with students at Lehman High School for a roundtable discussion about the COVID-19 vaccine. As COVID-19 cases surge, a majority of Americans say they support mask mandates for students and teachers in K-12 schools, but their views are sharply divided along political lines.Mark Lennihan/APShow MoreShow Less 5of11FILE - In this Aug. 18, 2020, file photo, students return to Greenbrae Elementary School in Sparks, Nev., for the first time since March 2020 with mandatory masks and social distancing to help guard against the spread of the coronavirus. As COVID-19 cases surge, a majority of Americans say they support mask mandates for students and teachers in K-12 schools, but their views are sharply divided along political lines.Scott Sonner/APShow MoreShow Less 7of11FILE - In this Aug. 17, 2021, file photo Leandra Walker, center, helps her daughter Mila Walker, 5, with her mask before she enters school with her siblings Olivia, 7, left, and her twin Max for the first day of classes in Richardson, Texas. A new poll finds that a majority of Americans support mask and vaccine mandates for students and teachers in K-12 schools. The poll from the Associated Press-NORC Center for Public Affairs Research finds that about 6 in 10 Americans say masks and vaccines should be required in schools.LM Otero/APShow MoreShow Less 8of11FILE - In this Aug. 12, 2021, file photo people listen to the Salt Lake County Council before their vote to overturned the health department's \"order of restraint\" that would have required K-6 students to wear masks. A new poll finds that a majority of Americans support mask and vaccine mandates for students and teachers in K-12 schools. The poll from the Associated Press-NORC Center for Public Affairs Research finds that about 6 in 10 Americans say masks and vaccines should be required in schools.Rick Bowmer/APShow MoreShow Less 10of11A new AP-NORC poll finds parents somewhat less likely than the broader population to favor requiring teachers and students at K-12 schools to wear masks, though only about a quarter are opposed.Kati Perry/APShow MoreShow Less  BOSTON (AP) — As COVID-19 cases surge around the country, a majority of Americans say they support mask mandates for students and teachers in K-12 schools, according to a new poll, but their views are sharply divided along political lines.About 6 in 10 Americans say students and teachers should be required to wear face masks while in school, according to a poll from The Associated Press-NORC Center for Public Affairs Research. Similar shares say teachers and eligible students should also be required to receive a COVID-19 vaccine. Masks have been a point of contention as U.S. schools reopen amid rising numbers of coronavirus cases. Questions about whether to require them have caused turmoil among parents and politicians, with some Republican governors banning mask mandates even as President Joe Biden threatens legal action against them. In a reflection of that polarizing debate, the poll finds a wide partisan divide. About 3 in 10 Republicans said they favor mask requirements for students and teachers, compared with about 8 in 10 Democrats. There was a similar split over vaccine mandates in schools.   Some of the nation's largest school districts will require masks for all students and staff this fall, including in New York City. That’s fine with Budhiono Riyanto, 37, of Queens, who will be sending his 7-year-old son, Gabriel, back to school next month. \"I understand personal choice, I understand personal freedom. But when it comes to public health, we should all be looking out for each other,” Rivanto said. “The best protection so far is to mask up and vaccinate.” Others say masks shouldn't be forced upon children. Kim Oldfield, who lives in rural Jessieville, Arkansas, said masks are unpopular in her area. She opposes the idea of a mandate and says it should be up to families to decide. In her local school district, masks are optional this fall. “America is supposed to be the land of the free,” said Oldfield, 70. “And when the government starts getting into your personal life and making you do things that you don’t want to do, people don’t like that.” Parents are slightly less likely to support mask requirements than the broader population, the poll shows. Fifty-two percent of parents with school-age children said they supported a mandate for kids, while 28% opposed it, with a similar split over mandates for teachers. There were also differences by race: About two-thirds of Black parents said they back mask mandates for teachers and students, compared with about half of white and Hispanic parents. The Centers for Disease Control and Prevention has recommended universal mask-wearing for teachers and students inside school buildings this fall, citing the rapid spread of the delta variant. In some areas with school mask mandates, tensions have flared in recent weeks. Protesters opposing mask requirements have filled school board meetings from Maryland to California, in some cases disrupting meetings and forcing them to postpone. Most states allow school districts to set their own mask policies, but some including California, Illinois and Louisiana are requiring masks for students and teachers statewide. At least eight Republican-led states have moved to ban universal mask mandates in schools, including in Texas, Florida and Tennessee. In Land O’ Lakes, Florida, Gail Jackson worries about sending her 12-year-old grandson to a school where masks are optional. Her grandson, Zahkai, wears a mask, she said, but some of his classmates don’t. “I don’t know how it’s all going to play out in the end,” said Jackson, 74, who is Zahkai’s legal guardian. “My prayer is that somehow or another, an angel passes over and these kids are allowed to grow and mature without finding themselves in a hospital on a ventilator.” Compared to mask mandates, school vaccine requirements have been rare. Some states and local districts have required vaccines for teachers, saying those who refuse must face regular virus testing. Some others have taken a harder stance, including Washington state, which says teachers must be inoculated or face dismissal.   Last week, the Culver City Unified district near Los Angeles was believed to be the first in the U.S. to require vaccines for all eligible students this fall. But student vaccine mandates are still uncommon, and the shots are not yet approved for children below age 12. The poll shows 59% of Americans support vaccination requirements for teachers and nearly as many — 55% — say the same for students age 12 and over, who are eligible to be vaccinated. Among parents, support was lower, with 42% backing vaccine mandates for students. Vaccinated parents were more likely to support mask and vaccine requirements than unvaccinated parents. Jeff Hicklin in Falmouth, Maine, said he supports mask and vaccine mandates for teachers and eligible students. He says it's the best way to protect those who are too young to be vaccinated, including his 7-year-old son, Oscar. “We need to do everything we can to keep schools open and safe,” said Hicklin, 40, an accountant. In Menomonie, Wisconsin, Erik Pederstuen has been vaccinated and plans to have his 9-year-old daughter inoculated once she's eligible. But Pederstuen, a technical college instructor, said he doesn’t think coronavirus vaccines should be a requirement. “I’m not an anti-vaccine person at all, I’ve just never liked the idea of it being forced,” said Pederstuen, 40. “I think everyone should get it, but I think it should be your choice.” ___ Fingerhut reported from Washington. ___ The AP-NORC poll of 1,729 adults was conducted Aug. 12-16 using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 3.2 percentage points. ",
         "article_author": "None"
      },
      "summarized_article": [
         {
            "summary_text": "As COVID-19 cases surge, a majority of Americans say they support mask mandates for students and teachers in K-12 schools. The poll from the Associated Press-NORC Center for Public Affairs Research finds that about 6 in 10 Americans say masks and vaccines should be required in schools. Masks have been a point of contention as U.S. schools reopen amid rising numbers of coronavirus cases."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "NJ.com",
      "source_icon": "",
      "title_article": "Cam Newton will miss at least 1 Giants-Patriots practice this week, due to COVID ‘misunderstanding’ | When will he return?",
      "description_article": "The Giants won’t see Patriots quarterback Cam Newton — their incumbent starter — on Wednesday when the teams hold a joint training camp practice in Foxborough, Mass. But there’s a possibility Newton could participate in the second and final Giants-Patriots joint practice on Thursday.",
      "url_article": "https://www.nj.com/giants/2021/08/cam-newton-will-miss-at-least-1-giants-patriots-practice-this-week-due-to-covid-misunderstanding-when-will-he-return.html",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.ZvzNpycPhsBFwvLciP0PbS",
      "publishedAt_article": "2021-08-23T16:09:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.nj.com/giants/2021/08/cam-newton-will-miss-at-least-1-giants-patriots-practice-this-week-due-to-covid-misunderstanding-when-will-he-return.html",
         "title_article": "Cam Newton will miss at least 1 Giants-Patriots practice this week, due to COVID ‘misunderstanding’ | When will he return?",
         "description_article": "",
         "urtToImage_article": "https://www.nj.com/resizer/09BXW-Qg5hTWbxXA_nutEU-yQBM=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/UTGBFQRYYJFZFNC5WITGGVCMNQ.jpg",
         "publishedAt_article": "2021-08-23T16:06:00.000Z",
         "content_article": "The Giants won’t see Patriots quarterback Cam Newton — their incumbent starter — on Wednesday when the teams hold a joint training camp practice in Foxborough, Mass.But there’s a possibility Newton could participate in the second and final Giants-Patriots joint practice on Thursday.Want more Giants coverage? Get exclusive news, behind-the-scenes observations and the ability to text directly with reportersHere is NBC Sports Boston with more: Cam Newton will be away from the team until Thursday in adherence with the NFL-NFL Players Association COVID protocols after leaving the New England area Saturday to receive medical treatment, the Patriots announced Monday.Here’s the Patriots statement:“On Saturday, Cam Newton traveled to a Club-approved medical appointment that required him to leave the New England area. He received daily Covid tests, which were all negative.“Due to a misunderstanding about tests conducted away from NFL facilities, and as required by the NFL-NFLPA protocols, Cam will be subject to the five-day entry cadence process before returning to the facility.“Cam will continue participating virtually in team activities and return to the club facility on Thursday, August 26.”Newton will miss New England’s practices on Monday and Tuesday as well as a joint practice session with the New York Giants on Wednesday.Per league protocols, Newton can return to the team after receiving a negative COVID test Thursday, so if he receives that result in time, he could participate in the Patriots’ second joint practice with the Giants on Thursday.As NFL Network noted, the Patriots’ statement indicates that Newton is not vaccinated. The Giants don’t have formal practice Monday or Tuesday this week. They travel to New England Tuesday, practice there Wednesday and Thursday, and then will hold a Giants-only, light practice Friday in East Rutherford. The Giants and Patriots will hold their third and final preseason game Sunday at MetLife Stadium. It remains unclear if Newton will be able to play, but it looks like he will, presuming he continues to test negative. The Patriots have yet to declare a Week 1 starter. It probably will be Newton, but rookie Mac Jones has played well in training camp and could wind up starting at some point this season. \r\nBuy Giants tickets: StubHub, TicketSmarter\r\n\r\nThe Patriots drafted Jones 15th overall this year, so they obviously have high hopes for him, as the potential, long-term replacement for Tom Brady. Thank you for relying on us to provide the journalism you can trust. Please consider supporting us with a subscription.Darryl Slater may be reached at dslater@njadvancemedia.com.",
         "article_author": "Darryl Slater | dslater@njadvancemedia.com"
      },
      "summarized_article": [
         {
            "summary_text": "Newton will miss New England’s practices on Monday and Tuesday as well as a joint practice session with the New York Giants on Wednesday. The Giants don’t have formal practice Monday or Tuesday this week. They travel to New England Tuesday, practice there Wednesday and Thursday, and then will hold a Giants-only, light practice Friday in East Rutherford."
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "TheStreet.com",
      "source_icon": "https://www.bing.com/th?id=AR_56eb34237378c28805a3d07d6d6e5189&pid=news",
      "title_article": "Jim Cramer on Pfizer's Trillium Deal: Oncology Is Ripe for Speculation",
      "description_article": "Jim Cramer says oncology is ripe for speculation following Pfizer's deal to buy Trillium Therapeutics for $2.26 billion.",
      "url_article": "https://www.thestreet.com/jim-cramer/jim-cramer-pfizer-trillium-oncology-speculation",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.CqEoYt9bFIGdv668WXCnZC",
      "publishedAt_article": "2021-08-23T16:09:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://www.thestreet.com/jim-cramer/jim-cramer-pfizer-trillium-oncology-speculation",
         "title_article": "Jim Cramer on Pfizer's Trillium Deal: Oncology Is Ripe for Speculation",
         "description_article": "",
         "urtToImage_article": "https://www.thestreet.com/.image/t_share/MTgyMjM4NTc3MDI1ODg1MzE1/pfizer.jpg",
         "publishedAt_article": "None",
         "content_article": "Pfizer  (PFE) - Get Report said it will buy Trillium Therapeutics  (TRIL) - Get Report in a deal that values the immuno-oncology specialist at $2.26 billion. Reacting to the deal, in addition to news of the Food and Drug Administration's approval and Pfizer and BioNtech's  (BNTX) - Get Report COVID vaccine, Jim Cramer said oncology companies are ripe for speculation if investors recognize the risk. \"Don't give up the ship on any oncology stock if they have trials,\" Cramer said. Catch Cramer's full take in the video above. Recap TheStreet Live: Everything Jim Cramer Is Watching 8/23/21Hear what Jim Cramer is only telling members of his Action Alerts PLUS investing club in Monday's Daily Rundown. ",
         "article_author": "Daniel Kuhn"
      },
      "summarized_article": [
         {
            "summary_text": "Pfizer said it will buy Trillium Therapeutics for $2.26 billion. Jim Cramer said oncology companies are ripe for speculation if investors recognize the risk. Cramer: \"Don't give up the ship on any oncologist stock if they have trials\""
         }
      ]
   },
   {
      "source_API": "bing",
      "query_name": "Virus News - US - Bing",
      "source_article": "People",
      "source_icon": "https://www.bing.com/th?id=AR_ee5a67672ebbcb1c0157d92cd8025988&pid=news",
      "title_article": "Sean Penn Says Not Getting COVID Vaccine Is Like 'Pointing a Gun in Somebody's Face'",
      "description_article": "Sean Penn isn't mincing words about his vaccine stance. On Saturday, the 61-year-old actor chatted with CNN's Michael Smerconish, explaining that he believes that COVID-19 vaccines should be mandatory amid the rise of the delta variant in America.",
      "url_article": "https://people.com/movies/sean-penn-says-going-unvaccinated-is-like-pointing-a-gun-in-somebodys-face/",
      "urtToImage_article": "https://www.bing.com/th?id=OVFT.lAznwqj5eE1-kjyRmg49VS",
      "publishedAt_article": "2021-08-23T16:08:00.0000000Z",
      "content_article": {
         "mercuryAPI_response": "200",
         "url_article": "https://people.com/movies/sean-penn-says-going-unvaccinated-is-like-pointing-a-gun-in-somebodys-face/",
         "title_article": "Sean Penn Says Not Getting COVID Vaccine Is Like 'Pointing a Gun in Somebody's Face'",
         "description_article": "",
         "urtToImage_article": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&rect=0%2C114%2C2000%2C1114&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2021%2F08%2F23%2Fsean-penn-covid-vaccinations-2000.jpg",
         "publishedAt_article": "None",
         "content_article": " Sean Penn isn't mincing words about his vaccine stance.      Get push notifications with news, features and more.    + Follow     \"I do believe that everyone should get vaccinated,\" Penn said during the interview. \"I believe it should be mandatory, like turning your headlights on in a car at night, but obviously that's not going to happen tomorrow and yet — at least it can happen in some areas and businesses, a lot of businesses are starting to take the lead on that.\" Penn then compared the dangers of going unvaccinated to threatening someone with a deadly weapon. \"... I have some areas of strong belief in the Second Amendment,\" he continued later in the conversation. \"But I think that you need to recognize how — with something like this — you can't go around pointing a gun in somebody's face, which is what it is when people are unvaccinated.\" The Oscar-winner has refused to show up to film the upcoming Starz limited series Gaslit and will only continue to participate if the entire production team gets the vaccine. Reps for Penn and the network did not immediately respond to PEOPLE's requests for comment at the time Penn's stance was first reported. \"Actors are protected, but if a stagehand is working alongside a stagehand who is not protected, then they can get sick,\" Penn told CNN. \"I didn't want to feel complicit in something that was just taking care of one group and not the other.\" Penn has reportedly offered to have his nonprofit Community Organized Relief Effort (CORE) (which he co-founded as a response relief organization in the aftermath of the 2010 earthquake that devastated Haiti) to administer the vaccinations. In March 2020, CORE began administering COVID-19 testing across the U.S., and this past January, the organization began providing vaccinations. Penn was vaccinated in January, tweeting at the time, \"I'm a lucky man.\" As information about the coronavirus pandemic rapidly changes, PEOPLE is committed to providing the most recent data in our coverage. Some of the information in this story may have changed after publication. For the latest on COVID-19, readers are encouraged to use online resources from the CDC, WHO and local public health departments. PEOPLE has partnered with GoFundMe to raise money for the COVID-19 Relief Fund, a GoFundMe.org fundraiser to support everything from frontline responders to families in need, as well as organizations helping communities. For more information or to donate, click here. ",
         "article_author": "Nicholas RiceAugust 23, 2021 12:08 PM"
      },
      "summarized_article": [
         {
            "summary_text": "Sean Penn said in an interview that he believes everyone should get vaccinated. He compared the dangers of going unvaccinated to threatening someone with a deadly weapon. The Oscar-winner has refused to show up to film the upcoming Starz limited series Gaslit if the entire production team gets the vaccine."
         }
      ]
   }
]

